; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v2 ?v13)
             (pred_7 ?v3 ?v1)
             (pred_8 ?v2 ?v1)
             (pred_4 ?v7 ?v2 )
	     (pred_2 ?v2)
             (pred_9 ?v9)
             (pred_12 ?v3)
             (pred_5 ?v1)
             (pred_1 ?v2)
             (pred_11 ?v3)
             (pred_6 ?v2)
             (pred_3 ))



(:action op_1
:parameters (?v4 ?v5 ?v8 ?v10)
:precondition (and (pred_9 ?v4) (pred_9 ?v5) (pred_12 ?v8) (pred_5 ?v10)
          (pred_10 ?v4 ?v5) (pred_7 ?v8 ?v10)
                   (pred_8 ?v5 ?v10) (pred_2 ?v4) 
                   (pred_1 ?v5) (pred_11 ?v8))
:effect (and  (pred_6 ?v5) (not (pred_1 ?v5))))


(:action op_3
:parameters (?v4 ?v6)
:precondition (and (pred_9 ?v4) (pred_9 ?v6)
               (pred_2 ?v4) (pred_10 ?v4 ?v6) (pred_6 ?v6))
:effect (and (pred_2 ?v6) (not (pred_2 ?v4))))

(:action op_2
:parameters (?v4 ?v8)
:precondition (and (pred_9 ?v4) (pred_12 ?v8) 
                  (pred_2 ?v4) (pred_4 ?v8 ?v4) (pred_3 ))
:effect (and (pred_11 ?v8)
   (not (pred_4 ?v8 ?v4)) (not (pred_3 ))))


(:action op_4
:parameters (?v4 ?v12 ?v11)
:precondition (and (pred_9 ?v4) (pred_12 ?v12) (pred_12 ?v11)
                  (pred_2 ?v4) (pred_11 ?v11) (pred_4 ?v12 ?v4))
:effect (and (pred_11 ?v12) (pred_4 ?v11 ?v4)
        (not (pred_11 ?v11)) (not (pred_4 ?v12 ?v4))))

(:action op_5
:parameters (?v4 ?v8)
:precondition (and (pred_9 ?v4) (pred_12 ?v8) 
                  (pred_2 ?v4) (pred_11 ?v8))
:effect (and (pred_3 ) (pred_4 ?v8 ?v4) (not (pred_11 ?v8)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_05 obj_07 obj_01 obj_16 obj_15 obj_18 obj_10 obj_08 obj_20 obj_12 obj_11 obj_14 obj_06 obj_09 obj_13 obj_02
    obj_03 obj_19
    obj_04 obj_17
    )

    (:init
       (pred_3)

       (pred_9 obj_05)
       (pred_9 obj_07)
       (pred_9 obj_01)
       (pred_9 obj_16)
       (pred_9 obj_15)
       (pred_9 obj_18)
       (pred_9 obj_10)
       (pred_9 obj_08)
       (pred_9 obj_20)
       (pred_9 obj_12)
       (pred_9 obj_11)
       (pred_9 obj_14)
       (pred_9 obj_06)
       (pred_9 obj_09)
       (pred_9 obj_13)
       (pred_9 obj_02)
       (pred_5 obj_03)
       (pred_5 obj_19)
       (pred_12 obj_04)
       (pred_12 obj_17)

       (pred_10 obj_05 obj_15)
       (pred_10 obj_05 obj_07)
       (pred_10 obj_07 obj_18)
       (pred_10 obj_07 obj_01)
       (pred_10 obj_07 obj_05)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_01 obj_16)
       (pred_10 obj_01 obj_07)
       (pred_10 obj_16 obj_08)
       (pred_10 obj_16 obj_01)
       (pred_10 obj_15 obj_20)
       (pred_10 obj_15 obj_18)
       (pred_10 obj_15 obj_05)
       (pred_10 obj_18 obj_12)
       (pred_10 obj_18 obj_10)
       (pred_10 obj_18 obj_07)
       (pred_10 obj_18 obj_15)
       (pred_10 obj_10 obj_11)
       (pred_10 obj_10 obj_08)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_10 obj_18)
       (pred_10 obj_08 obj_14)
       (pred_10 obj_08 obj_16)
       (pred_10 obj_08 obj_10)
       (pred_10 obj_20 obj_06)
       (pred_10 obj_20 obj_12)
       (pred_10 obj_20 obj_15)
       (pred_10 obj_12 obj_09)
       (pred_10 obj_12 obj_11)
       (pred_10 obj_12 obj_18)
       (pred_10 obj_12 obj_20)
       (pred_10 obj_11 obj_13)
       (pred_10 obj_11 obj_14)
       (pred_10 obj_11 obj_10)
       (pred_10 obj_11 obj_12)
       (pred_10 obj_14 obj_02)
       (pred_10 obj_14 obj_08)
       (pred_10 obj_14 obj_11)
       (pred_10 obj_06 obj_09)
       (pred_10 obj_06 obj_20)
       (pred_10 obj_09 obj_13)
       (pred_10 obj_09 obj_12)
       (pred_10 obj_09 obj_06)
       (pred_10 obj_13 obj_02)
       (pred_10 obj_13 obj_11)
       (pred_10 obj_13 obj_09)
       (pred_10 obj_02 obj_14)
       (pred_10 obj_02 obj_13)
       (pred_1 obj_20)
       (pred_1 obj_08)
       (pred_8  obj_20 obj_03)
       (pred_8  obj_08 obj_19)
       (pred_6 obj_05)
       (pred_6 obj_07)
       (pred_6 obj_01)
       (pred_6 obj_16)
       (pred_6 obj_15)
       (pred_6 obj_18)
       (pred_6 obj_10)
       (pred_6 obj_12)
       (pred_6 obj_11)
       (pred_6 obj_14)
       (pred_6 obj_06)
       (pred_6 obj_09)
       (pred_6 obj_13)
       (pred_6 obj_02)

       (pred_7  obj_04 obj_03)
       (pred_7  obj_17 obj_19)
       (pred_4 obj_04 obj_16)
       (pred_4 obj_17 obj_06)
       (pred_2 obj_06)
    )

    (:goal (and
       (pred_4 obj_04 obj_20)
    ))
(:constraints
  (always (not (pred_2 obj_07)))
)
)

; plan
1. (op_3 obj_06 obj_09)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_09)
   goals met: 0 of 1
2. (op_3 obj_09 obj_12)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_12)
   goals met: 0 of 1
3. (op_3 obj_12 obj_18)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_18)
   goals met: 0 of 1
4. (op_3 obj_18 obj_10)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_10)
   goals met: 0 of 1
5. (op_3 obj_10 obj_01)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_01)
   goals met: 0 of 1
6. (op_3 obj_01 obj_16)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_16)
   goals met: 0 of 1
7. (op_2 obj_16 obj_04)
   deleted: (pred_4 obj_04 obj_16) (pred_3)
   added: (pred_11 obj_04)
   goals met: 0 of 1
8. (op_3 obj_16 obj_01)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_01)
   goals met: 0 of 1
9. (op_3 obj_01 obj_10)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_10)
   goals met: 0 of 1
10. (op_3 obj_10 obj_18)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_18)
   goals met: 0 of 1
11. (op_3 obj_18 obj_15)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_15)
   goals met: 0 of 1
12. (op_1 obj_15 obj_20 obj_04 obj_03)
   deleted: (pred_1 obj_20)
   added: (pred_6 obj_20)
   goals met: 0 of 1
13. (op_3 obj_15 obj_20)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_20)
   goals met: 0 of 1
14. (op_5 obj_20 obj_04)
   deleted: (pred_11 obj_04)
   added: (pred_3) (pred_4 obj_04 obj_20)
   goals met: 1 of 1
